CSI API ETABS v1
cCaseResponseSpectrum.GetModalComb Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetModalComb(
	string Name,
	ref int MyType,
	ref double F1,
	ref double F2,
	ref double Td
)
Function GetModalComb (
	Name As String,
	ByRef MyType As Integer,
	ByRef F1 As Double,
	ByRef F2 As Double,
	ByRef Td As Double
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim MyType As Integer
Dim F1 As Double
Dim F2 As Double
Dim Td As Double
Dim returnValue As Integer
returnValue = instance.GetModalComb(Name,
	MyType, F1, F2, Td)
int GetModalComb(
	String^ Name,
	int% MyType,
	double% F1,
	double% F2,
	double% Td
)
abstract GetModalComb :
        Name : string *
        MyType : int byref *
        F1 : float byref *
        F2 : float byref *
        Td : float byref -> int
Parameters
Name
Type: System.String
MyType
Type: System.Int32
F1
Type: System.Double
F2
Type: System.Double
Td
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace